{
  "id": 1564,
  "tdc_id": 651001,
  "title": "Updated - Chinese sophisticated threat actor UNC3886 secretly exploiting CVE-2023-34048 since late 2021",
  "severity": 4,
  "tags": ["unc3886"],
  "threat_category": "Threat",
  "content_blocks": [
    {
      "id": 3417,
      "advisory": 1564,
      "index": 3,
      "title": "Updated - Chinese sophisticated threat actor UNC3886 secretly exploiting CVE-2023-34048 since late 2021",
      "tags": [],
      "severity": 4,
      "analyst": 3,
      "last_modified_by": 3,
      "threat_category": "Vulnerability",
      "executive_summary": "<p>According to reports from <a href=\"https://www.mandiant.com/resources/blog/chinese-vmware-exploitation-since-2021\"><strong>Mandiant</strong></a> and <strong>VMware</strong>, a critical vulnerability identified in VMware vCenter Server (<strong>CVE-2023-34048, </strong><a href=\"https://portal.cert.orangecyberdefense.com/vulns/58701\">link</a> to the advisory for our Vuln Intelligence clients) has been exploited since late 2021 by a sophisticated Chinese threat actor tracked under the moniker <strong>UNC3886</strong>.<br />\r\n<br />\r\nAs a reminder, this<strong> 0-day</strong> was patched in vCenter Server 6.7U3, 6.5U3, 8.0U1 and VCF 3.x last October 2023. It allows a <strong>remote</strong> attacker to write data outside of the bounds of the memory in the DCE/RPC protocol implementation. A <strong>unauthenticated</strong> attacker could exploit this flaw via specially crafted requests to execute arbitrary code and potentially gain unauthorized access to vCenter systems, enabling further attacks. As a reminder, UNC3886 is known to focus specifically on organizations in the defense, government, telecommunications and technology sectors, notably in the United States.<br />\r\n<br />\r\nMandiant discovered the exploitation of the 0-day after investigating the attacks described in our previous update, involving backdoors they call VirtualPita, VirtualPie and VirtualGate. They observed several crashes corresponding to the exploitation of the 0-day, just before the backdoors were implanted, in several cases related to UNC3886. Threat actors are presumed to have been leveraging the issue possibly since late 2021.<br />\r\n<br />\r\nThe affected environments had preserved log entries, but the &quot;vmdird&quot; core dumps had been intentionally deleted by the attacker to cover its tracks. Furthermore, Mandiant claims that the attack is highly sophisticated, and difficult to identify. We therefore encourage you urgently implement the VMware patch, and hunt for possible sign of compromise, for example in VMware service crash logs (/var/log/vMonCoredumper.log).<br />\r\n<br />\r\nIt is important to note that this threat actor abused <a href=\"https://portal.cert.orangecyberdefense.com/worldwatch/651001\">0-days</a> against VMware or Fortinet products in the past in order to compromise its targets while remaining undetected (see below). This latest operation shows once again that UNC3886 is a skilled actor in the threat landscape.<br />\r\n<br />\r\nThe risk level associated with this threat advisory is thus increased at the level of <strong>4 out of 5</strong>.</p>",
      "what_you_will_hear": "",
      "what_it_means": "",
      "what_you_should_do": "",
      "what_we_are_doing": "",
      "sources": [
        {
          "id": 7786,
          "title": "",
          "url": "https://www.mandiant.com/resources/blog/chinese-vmware-exploitation-since-2021",
          "description": "",
          "type": "external"
        },
        {
          "id": 7787,
          "title": "",
          "url": "https://www.vmware.com/security/advisories/VMSA-2023-0023.html",
          "description": "",
          "type": "external"
        },
        {
          "id": 7788,
          "title": "Vuln Watch",
          "url": "https://portal.cert.orangecyberdefense.com/vulns/58701",
          "description": "",
          "type": "internal"
        }
      ],
      "detection_rules": [],
      "datalake_url": null,
      "other": "",
      "timestamp_created": "2024-01-22T15:36:48Z",
      "timestamp_updated": "2024-06-19T12:21:23.948Z"
    },
    {
      "id": 3414,
      "advisory": 1564,
      "index": 2,
      "title": "Updated - Mandiant says UNC3886 exploits a zero-day vulnerability in VMware ESXi",
      "tags": ["cve-2023-20867", "unc3886", "cve-2023-34048"],
      "severity": 3,
      "analyst": 3,
      "last_modified_by": 3,
      "threat_category": "Threat",
      "executive_summary": "<p>According to a <a href=\"https://www.mandiant.com/resources/blog/vmware-esxi-zero-day-bypass\">report</a> released by <strong>Mandiant</strong>, Chinese threat actor <strong>UNC3886 </strong>exploited a zero-day tracked as <strong><a href=\"https://portal.cert.orangecyberdefense.com/vulns/56572\">CVE-2023-20867</a>, </strong>vulnerability affecting <strong>VMware ESXi</strong> via VMware Tools, to backdoor Windows and Linux virtual machines and <strong>steal data</strong>. VMware Tools is a set of services and modules for enhanced management of guest operating systems. The threat actor allegedly used this authentication bypass flaw to deploy <strong>VirtualPita </strong>and <strong>VirtualPie </strong>backdoors on guest VMs from compromised ESXi hosts where they escalated privileges to root. A third malware strain, <strong>VirtualGate</strong>, acts as a memory-only dropper that deobfuscates second-stage DLL payloads on the hijacked VMs. VMware assessed the flaw as being of <strong>medium severity</strong> because an attacker already needs to have <strong>root access</strong> on an ESXi host.<br />\r\n<br />\r\nIt is worth mentioning that as reported in our initial advisory below, UNC3886 has targeted VMware ESXi servers throughout 2022. Mandiant reported the latest flaw to VMware which released a <a href=\"https://www.vmware.com/security/advisories/VMSA-2023-0013.html\">patch</a> addressing it on June 13. Mandiant found UNC3886 using CVE-2023-20867 as part of a larger and sophisticated attack chain that its researchers have been unraveling over the past several months. The cybersecurity giant added that these attacks were launched against <strong>defense, technology and telecommunications companies</strong>. Mandiant added that the threat actor also adopted previously other advanced techniques such as:<br />\r\n&nbsp;</p>\r\n\r\n<ul>\r\n\t<li style=\"text-align:justify\">the harvesting of connected ESXi service account credentials on vCenter servers (abusing another older VMware numbered <a href=\"https://portal.cert.orangecyberdefense.com/vulns/50290\">CVE-2023-22948,</a></li>\r\n\t<li style=\"text-align:justify\">the capabilities of the VMCI socket backdoor.</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><br />\r\nMandiant believes this attack chain is very sophisticated, hard to detect and that there are most likely more victims dealing with this threat actor. Thus, we strongly recommend applying the patch released by VMware as soon as possible.<br />\r\n<br />\r\nThe threat level associated with this threat actor will nevertheless remains for now at 3 out of 5.</p>\r\n\r\n<p>&nbsp;</p>",
      "what_you_will_hear": "",
      "what_it_means": "",
      "what_you_should_do": "",
      "what_we_are_doing": "",
      "sources": [
        {
          "id": 7775,
          "title": "",
          "url": "https://www.mandiant.com/resources/blog/vmware-esxi-zero-day-bypass",
          "description": "",
          "type": "external"
        },
        {
          "id": 7776,
          "title": "",
          "url": "https://www.vmware.com/security/advisories/VMSA-2023-0013.html",
          "description": "",
          "type": "external"
        },
        {
          "id": 7777,
          "title": "",
          "url": "https://portal.cert.orangecyberdefense.com/worldwatch/696477",
          "description": "",
          "type": "internal"
        },
        {
          "id": 7778,
          "title": "Vuln Watch",
          "url": "https://portal.cert.orangecyberdefense.com/vulns/56572",
          "description": "",
          "type": "internal"
        }
      ],
      "detection_rules": [],
      "datalake_url": {
        "id": 473,
        "title": "",
        "description": "",
        "url": "https://datalake.cert.orangecyberdefense.com/gui/search?query_hash=8555a475181d77015f5a96d9ff30b229"
      },
      "other": "",
      "timestamp_created": "2023-06-14T11:11:59Z",
      "timestamp_updated": "2023-06-14T11:11:59Z"
    },
    {
      "id": 3415,
      "advisory": 1564,
      "index": 1,
      "title": "Updated - Suspected Chinese actors behind recent FortiGate zero-day attacks",
      "tags": ["cve-2022-41328"],
      "severity": 3,
      "analyst": 3,
      "last_modified_by": 3,
      "threat_category": "Threat",
      "executive_summary": "<p>Shortly after Fortinet disclosed that <a href=\"https://portal.cert.orangecyberdefense.com/vulns/55111\">CVE-2022-41328</a>, a medium-severity path traversal vulnerability in FortiOS, had been exploited by unknown sophisticated threat actors targeting governmental entities (as discussed in this <a href=\"https://portal.cert.orangecyberdefense.com/worldwatch/696477\">World Watch alert</a>), Mandiant released a detailed report attributing this campaign to <strong>UNC3886</strong>.<br />\r\n<br />\r\nAccording to Mandiant, the campaign started in mid-2022, and the threat actor infected multiple Fortinet solutions with malware, including FortiGate (firewall), FortiManager (centralized management solution), and FortiAnalyzer (log management, analytics and reporting). Furthermore, the hackers also deployed the <strong>VirtualPita </strong>and <strong>VirtualPie </strong>backdoors (as discussed in the previous update) on VMWare ESXI servers during the campaign.<br />\r\n<br />\r\nAfter the attackers initially gained access to an exposed FortiManager instance, they modified legitimate Python code to implement a custom backdoor dubbed <strong>ThinCrust </strong>to FortiManager and FortiAnalyzer. ThinCrust is a Python-based backdoor appended to a legitimate web framework file. The backdoor disguises its communications as legitimate API calls by including an additional malicious API call. The backdoor allows the attacker to execute commands, write files to disk and read files from disk depending on the cookies provided in the request.<br />\r\n<br />\r\nAfter establishing persistence on FortiManager and FortiAnalyzer, the threat actor then modified FortiManager scripts to deploy the <strong>CastleTap </strong>backdoor across all FortiGate devices by exploiting CVE-2022-41328. This vulnerability allowed the threat actor to overwrite system binaries, and then use legitimate commands that relied on those binaries to achieve code executon. UNC3886 then finally deployed an additional malicious file containing CastleTap. This passive backdoor examines received ICMP packets looking for a hardcoded string in the payload of an ICMP echo request packet (ping packet). After detecting this activation string, CastleTap parses C2 information from the packet payload and connects to it over SSL. The backdoor then offers standard functionality of uploading/downloading files and command execution.<br />\r\n<br />\r\nThe threat actor also connected to the ESXi servers via the compromised Fortinet devices to install the VirtualPita and VirtualPie backdoors, which allowed them to execute commands on guest virtual machines.<br />\r\n<br />\r\nAfter network Access Control Lists (ACL) were put in place to restrict traffic to the FortiManager instance, the attacker deployed an additional network traffic redirection malware dubbed <strong>TableFlip </strong>and a reverse shell backdoor dubbed <strong>Reptile </strong>on the FortiManager to bypass the ACL. This gave the threat actor the ability to create their own traffic redirection rules, allowing them to bypass any traffic redirection rule put in place to block their access. Then, the threat actor configured redirection rules to forward incoming malicious traffic from the internet to the Reptile backdoor. Reptile is a variant of a publicly available Linux kernel module rootkit which listens for a hardcoded strings on incoming packets and opens a reverse shell to the C2 IP extracted from the packet payload data.<br />\r\n<br />\r\nFinally, Mandiant also observed several anti-forensic commands executed by the threat actor in order to cover their tracks and remove suspicious log lines.<br />\r\n<br />\r\nDue to the high sophistication of this campaign, which included deploying multiple custom stealthy backdoors, exploiting a zero-day and manipulating firewall firmware, we are increasing the severity level associated to this threat to 3 out of 5.</p>",
      "what_you_will_hear": "",
      "what_it_means": "",
      "what_you_should_do": "",
      "what_we_are_doing": "",
      "sources": [
        {
          "id": 7779,
          "title": "",
          "url": "https://www.mandiant.com/resources/blog/fortinet-malware-ecosystem",
          "description": "",
          "type": "external"
        },
        {
          "id": 7780,
          "title": "",
          "url": "https://portal.cert.orangecyberdefense.com/worldwatch/696477",
          "description": "",
          "type": "internal"
        },
        {
          "id": 7781,
          "title": "Vuln Watch",
          "url": "https://portal.cert.orangecyberdefense.com/vulns/55111",
          "description": "",
          "type": "internal"
        }
      ],
      "detection_rules": [],
      "datalake_url": {
        "id": 474,
        "title": "",
        "description": "",
        "url": "https://datalake.cert.orangecyberdefense.com/gui/search?query_hash=8555a475181d77015f5a96d9ff30b229"
      },
      "other": "",
      "timestamp_created": "2023-03-17T12:50:10Z",
      "timestamp_updated": "2024-06-19T12:20:15.289Z"
    },
    {
      "id": 3413,
      "advisory": 1564,
      "index": 0,
      "title": "UNC3886 backdoors ESXi servers to hijack virtual machines",
      "tags": ["unc3886"],
      "severity": 3,
      "analyst": 3,
      "last_modified_by": 3,
      "threat_category": "Threat",
      "executive_summary": "<p>Researchers from Mandiant <a href=\"https://www.mandiant.com/resources/blog/esxi-hypervisors-malware-persistence\">uncovered</a> a <strong>novel malware ecosystem </strong>impacting VMware ESXi, Linux vCenter servers, and Windows virtual machines. It enables a threat actor to <strong>maintain persistent administrative access </strong>to the hypervisor, send commands that will be routed to the guest VM for execution, transfer files, tamper with logging services and execute arbitrary commands from one VM to another. This is achieved by using malicious vSphere Installation Bundles (VIBs) to install multiple backdoors across ESXi hypervisors. It is important to note that this is not an unauthenticated nor remote vulnerability, because <strong>prior administrative access </strong>to the ESXi hypervisor is required in order to deploy the backdoor.Mandiant could not attribute this malicious activity to any known threat actor yet, so it tracks it separately as <strong>UNC3886</strong>. Given the highly targeted and evasive nature of the intrusion, the researchers suspect that the threat actor&#39;s motivation is <strong>cyberespionage</strong> related, and that the group has ties with <strong>China</strong>.</p>",
      "what_you_will_hear": "<p>New malware backdoors ESXi servers to hijack virtual machines.</p>",
      "what_it_means": "<p>During an intrusion investigated earlier this year, Mandiant researchers identified two new malware families installed through malicious VIBs, dubbed <strong>VirtualPita </strong>and <strong>VirtualPie</strong>.<br />\r\nVirtualPita is a 64-bit passive backdoor that creates a listener on a hardcoded port number on a compromised VMware ESXi server. It often uses legitimate VMware service names and ports to masquerade as a legitimate service. The backdoor supports the following features:</p>\r\n\r\n<ul>\r\n\t<li style=\"text-align:justify\">arbitrary command execution,</li>\r\n\t<li style=\"text-align:justify\">file upload and download,</li>\r\n\t<li style=\"text-align:justify\">and the ability to start and stop the VMware&#39;s logging daemon &quot;vmsyslogd&quot;.</li>\r\n</ul>\r\n\r\n<p><br />\r\nDuring arbitrary command execution, the malware sets the environment variable HISTFILE to 0, to instruct the system to not keep any logs of the Bash commands executed. During the investigation, the researchers found 2 additional VirtualPita samples listening on TCP port 7475, that persist on the system using an &quot;init.d&quot; startup service on Linux vCenter, disguised as a legitimate binary named &quot;ksmd&quot;.<br />\r\nVirtualPie is a lightweight Python-based backdoor that spawns an IPv6 listener on a hardcoded port on a VMware ESXi server. It supports:</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<ul>\r\n\t<li style=\"text-align:justify\">arbitrary command execution,</li>\r\n\t<li style=\"text-align:justify\">file transfer</li>\r\n\t<li style=\"text-align:justify\">and reverse shell capabilities.</li>\r\n</ul>\r\n\r\n<p><br />\r\nThis backdoor uses a custom protocol for communication, which is encrypted using a RC4 key.<br />\r\nFinally, in guest VMs running Windows under such an infected hypervisor, the researchers found another malware, dubbed VirtualGate, which includes a memory-only dropper responsible for deobfuscating a second-stage DLL payload.<br />\r\nAs for post-exploitation, the attacker executed commands observed by Mandiant focused on enumeration and file compression across the system and connected file shares, as well as credential harvesting using MiniDump (a tool which dumps process memory and search for cleartext credentials).We have attributed a risk-level of 1 to this alert as these malware strains, although stealthy, are mainly used in targeted cyber espionage campaigns and require to have administrative rights to be deployed.</p>\r\n\r\n<p>&nbsp;</p>",
      "what_you_should_do": "<p>On a separate <a href=\"https://www.mandiant.com/resources/blog/esxi-hypervisors-detection-hardening\">blog post</a>, Mandiant describes ESXi detection methodologies, which involve dumping memory processes and performing Yara scans, as well as provides guidance on how to harden hypervisors to minimize the attack surface of ESXi hosts. VMware has also released <a href=\"https://core.vmware.com/vsphere-esxi-mandiant-malware-persistence\">additional information</a> on protecting vSphere from targeted malware.Some Yara rules provided by Mandiant are available in the Appendices. IoCs from the malware strains are also available in the original article and in our Datalake platform used by our Managed Threat Detection services. These can be proactively added and hunted for in your security solutions (SIEM, NGFW, EDR, etc.). Orange Cyberdefense can orchestrate the automatic feeding of such network-related IOCs in your firewall equipments using our &quot;Managed Threat Intelligence - protect&quot; service.</p>",
      "what_we_are_doing": "",
      "sources": [
        {
          "id": 7772,
          "title": "",
          "url": "https://www.mandiant.com/resources/blog/esxi-hypervisors-malware-persistence",
          "description": "",
          "type": "external"
        },
        {
          "id": 7773,
          "title": "",
          "url": "https://www.mandiant.com/resources/blog/esxi-hypervisors-detection-hardening",
          "description": "",
          "type": "external"
        },
        {
          "id": 7774,
          "title": "",
          "url": "https://core.vmware.com/vsphere-esxi-mandiant-malware-persistence",
          "description": "",
          "type": "external"
        }
      ],
      "detection_rules": [],
      "datalake_url": {
        "id": 472,
        "title": "",
        "description": "",
        "url": "https://datalake.cert.orangecyberdefense.com/gui/search?query_hash=8555a475181d77015f5a96d9ff30b229"
      },
      "other": "",
      "timestamp_created": "2022-09-30T13:29:49Z",
      "timestamp_updated": "2024-06-19T12:16:06.725Z"
    }
  ],
  "timestamp_created": "2022-10-03T10:40:11Z",
  "timestamp_updated": "2024-06-19T12:21:23.948Z",
  "license_agreement": "This advisory has been prepared and is the property of Orange Cyberdefense. Please don't redistribute this content without our agreement."
}
